app/Controllers/BackendController.php

SELECT *
FROM `tb_category`
---
    public function index()
    {

        $data['session'] = session();
        $data['categorys'] = $this->categoryModel->findAll();

SELECT COUNT(*) AS `numrows`
FROM `tb_users`
SELECT COUNT(*) AS `numrows`
FROM `tb_users`
WHERE `gender` = 'ผู้ชาย'
SELECT COUNT(*) AS `numrows`
FROM `tb_users`
WHERE `gender` = 'ผู้หญิง'
---
    public function load_content_dashboard()
    {

        $data['datetime'] = $this->memberModal->getLoginCountsByDate();
        $data['sum_users'] = $this->memberModal->countAllResults();
        $data['male'] = $this->memberModal->where('gender', 'ผู้ชาย')->countAllResults();
        $data['female'] = $this->memberModal->where('gender', 'ผู้หญิง')->countAllResults();

SELECT *
FROM `tb_admin`
---
    public function load_content_administrator()
    {
        $data['admins'] = $this->adminModel->findAll();

SELECT *
FROM `tb_category`
---
    public function load_content_category()
    {
        $data['categorys'] = $this->categoryModel->findAll();

SELECT *
FROM `tb_activity`
---
    public function load_content_activity()
    {
        $data['activitys'] = $this->activityModel->findAll();

SELECT *
FROM `tb_activity_album`
---
    public function load_content_album()
    {
        $data['albums'] = $this->activityAlbumModel->findAll();

SELECT *
FROM `tb_activity`
WHERE `uuid` = '9978706a-1649-4aab-84d0-f13f1ef0b7fb'
 LIMIT 1
---
    public function edit_activity_modal($uuid = '')
    {
        $uuid = $this->request->getPost('uuid');
        $data['categorys'] = $this->categoryModel->findAll();
        $data['activity'] = $this->activityModel->where('uuid', $uuid)->first();