app/Controllers/BackendController.php

SELECT *
FROM `tb_activity`
---
    public function load_content_activity()
    {
        $data['activitys'] = $this->activityModel->findAll();