app/Controllers/HomeController.php

SELECT *
FROM `tb_category`
SELECT *
FROM `tb_activity`
SELECT *
FROM `tb_activity_album`
---
    public function index()
    {
        $data['categorys'] = $this->categoryModel->findAll();
        $data['activitys'] = $this->activityModel->findAll();
        $data['albums'] = $this->activityAlbumModel->findAll();