app/Models/ActivityModel.php

SELECT *
FROM `tb_activity`
WHERE `category_id` = '14'
SELECT *
FROM `tb_activity`
---
    function getActivityWhere($id) {
        if($id != 0 ) {
            return $this->where('category_id', $id)->findAll();
        }else{
            return $this->findAll();