app/Libraries/Auth.php

SELECT `library_path`
FROM `tb_library`
WHERE `library_name` = 'localhost'
---
    public function get_library()
    {
        $result = $this->db->table('tb_library')->select('library_path')->where('library_name', $_SERVER['SERVER_NAME'])->get()->getRow();